recept/src/Documents/Производство/Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Производство</name>
  <registerRecords>AccumulationRegister.СтадииВыполненияЗаказов</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РольКомпонента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СборкаКомплектов</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
  <enumValues>
    <name>УслугаРазделитель</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
</mdclass:Enum>

recept/src/Catalogs/Комплектации/Комплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Комплектации</name>
  <owners>Catalog.НоменклатураМатериалы</owners>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

recept/src/Catalogs/Спецификации/Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спецификации</name>
  <owners>Catalog.ХарактеристикиНоменклатуры</owners>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристики</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

recept/src/Documents/Производство/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Или ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Данные уже агрегированы и свернуты на стороне формы подбора
	СвернутыеДанные = ВыбранноеЗначение;
	
	// 1. Первая уникальная позиция идет в ТЕКУЩИЙ открытый документ (перезаписываем шапку)
	ПерваяПозиция = СвернутыеДанные[0];
	Объект.Номенклатура   = ПерваяПозиция.Номенклатура;
	Объект.Характеристика = ПерваяПозиция.Характеристика;
	Объект.Количество     = ПерваяПозиция.Количество;
	
	// 2. Для остальных позиций программно открываем НОВЫЕ окна документов
	Если СвернутыеДанные.Количество() > 1 Тогда
		
		Для Инд = 1 По СвернутыеДанные.Количество() - 1 Цикл
			ТекущаяПозиция = СвернутыеДанные[Инд];
			
			// Формируем параметры заполнения для нового документа
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("Номенклатура",   ТекущаяПозиция.Номенклатура);
			ЗначенияЗаполнения.Вставить("Характеристика", ТекущаяПозиция.Характеристика);
			ЗначенияЗаполнения.Вставить("Количество",     ТекущаяПозиция.Количество);
			
			ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
			
			// Платформа откроет форму и автоматически передаст параметры в ОбработкаЗаполнения() модуля объекта
			ОткрытьФорму("Документ.Производство.ФормаОбъекта", ПараметрыОткрытия);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоСпецификации(Команда)
	ЗаполнитьПоСпецификацииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПодобратьИзЗаявок(Команда)
	
	// Открываем форму подбора в режиме выбора
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораЗаявок", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоСпецификацииНаСервере()
	
	// Очищаем таблицы перед заполнением
	Объект.Состав.Очистить();
	Объект.СборкаКомплектов.Очистить();
	
	// Проверяем базовые заполненные реквизиты
	Если Не ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		ВызватьИсключение "Не выбрана номенклатура выпуска!";
	КонецЕсли;
	
	// Сценарий 1: Производство комплекта
	Если Объект.НоменклатураМатериалы.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Комплектация) Тогда
			ВызватьИсключение "Для комплекта необходимо выбрать Комплектацию!";
		КонецЕсли;
		
		// Читаем состав комплектации
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Комплектация", Объект.Комплектация);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КомплектацииСостав.Номенклатура,
			|	КомплектацииСостав.Характеристика,
			|	КомплектацииСостав.Количество * &КоэффициентВыпуска КАК Количество
			|ИЗ
			|	Справочник.Комплектации.Состав КАК КомплектацииСостав
			|ГДЕ
			|	КомплектацииСостав.Ссылка = &Комплектация";
		
		Запрос.УстановитьПараметр("КоэффициентВыпуска", Объект.Количество);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.СборкаКомплектов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	// Сценарий 2: Стандартное производство (Сырье + Услуги)
	Иначе
		
		Если Не ЗначениеЗаполнено(Объект.Спецификация) Тогда
			ВызватьИсключение "Выберите спецификацию (Эконом/Стандарт/Премиум) для заполнения!";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Спецификация", Объект.Спецификация);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СпецификацииСостав.Номенклатура КАК Номенклатура,
			|	СпецификацииСостав.Характеристика КАК Характеристика,
			|	СпецификацииСостав.Количество КАК КоличествоНорма,
			|	СпецификацииСостав.РольКомпонента КАК РольКомпонента,
			|	СпецификацииСостав.ЭтоУслуга КАК ЭтоУслуга
			|ИЗ
			|	Справочник.Спецификации.Состав КАК СпецификацииСостав
			|ГДЕ
			|	СпецификацииСостав.Ссылка = &Спецификация";
			
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Объект.Состав.Добавить();
			
			// ОБРАБОТКА ИСТОРИЧЕСКИХ ДАННЫХ (Пустая строка в старых спецификациях)
			// Если в спецификации Номенклатура пустая — платформа создаст визуальный разделитель
			Если Не ЗначениеЗаполнено(Выборка.Номенклатура) И Не Выборка.ЭтоУслуга Тогда
				// Оставляем строку пустой для визуального разделения компонентов на форме
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока.Номенклатура    = Выборка.Номенклатура;
			НоваяСтрока.Характеристика  = Выборка.Характеристика;
			НоваяСтрока.РольКомпонента  = Выборка.РольКомпонента;
			
			// Логика для услуги "Переработка"
			Если Выборка.ЭтоУслуга Тогда
				НоваяСтрока.Количество = 1; // Согласно ТЗ: либо 1, либо пустая
				// Цена переработки может подтягиваться из регистра цен или заполняться вручную
				НоваяСтрока.Цена       = 0; 
				НоваяСтрока.Сумма      = 0;
			Иначе
				// Расчет сырья пропорционально объему производства
				НоваяСтрока.Количество = Выборка.КоличествоНорма * Объект.Количество;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвернутьВыбранныеЗаявки(МассивДанных)
	// Используем Таблицу Значений для быстрой группировки одинаковых позиций
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Характеристика");
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого Стр Из МассивДанных Цикл
		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Стр);
	КонецЦикла;
	
	ТЗ.Свернуть("Номенклатура, Характеристика", "Количество");
	
	// Возвращаем массив структур обратно на клиент
	МассивРезультат = Новый Массив;
	Для Каждого Стр Из ТЗ Цикл
		МассивРезультат.Добавить(Новый Структура("Номенклатура, Характеристика, Количество", Стр.Номенклатура, Стр.Характеристика, Стр.Количество));
	КонецЦикла;
	
	Возврат МассивРезультат;
КонецФункции

#КонецОбласти
